In [1]:
import pandas as pd
import numpy as np
from tqdm import tqdm
import pandas as pd
import numpy as np
from tqdm import tqdm
import time
import matplotlib.pyplot as plt
from sklearn.preprocessing import normalize
import gc
tqdm.pandas()
gc.collect()

C:\Users\ricky\anaconda3\lib\site-packages\tqdm\std.py:658: FutureWarning: The Panel class is removed from pandas. Accessing it from the top-level namespace will also be removed in the next version
  from pandas import Panel

15

# LOAD

In [2]:
%%time
df = pd.read_feather('../data/2021玉山人工智慧公開挑戰賽冬季賽訓練資料集.feather')
df = df.loc[df.dt>=12,:] #取最近一年即可
print(df.shape,df.isnull().sum().sum())
df.head()

(19786604, 53) 1509444
Wall time: 34.7 s

,dt,chid,shop_tag,txn_cnt,txn_amt,domestic_offline_cnt,domestic_online_cnt,overseas_offline_cnt,overseas_online_cnt,domestic_offline_amt_pct,...,masts,educd,trdtp,naty,poscd,cuorg,slam,gender_code,age,primary_card
13188928,12.0,10115966.0,15,1.0,9678.450445,1.0,0.0,0.0,0.0,1.00,...,1.0,4.0,15.0,1.0,1.0,30.0,133000.939458,0.0,5.0,1.0
13188938,12.0,10115966.0,18,1.0,9624.614033,1.0,0.0,0.0,0.0,1.00,...,1.0,4.0,15.0,1.0,1.0,30.0,133000.939458,0.0,5.0,1.0
13188944,12.0,10115966.0,25,1.0,2338.181448,1.0,0.0,0.0,0.0,1.00,...,1.0,4.0,15.0,1.0,1.0,30.0,133000.939458,0.0,5.0,1.0
13188946,12.0,10115966.0,26,2.0,16627.150110,2.0,0.0,0.0,0.0,1.00,...,1.0,4.0,15.0,1.0,1.0,30.0,133000.939458,0.0,5.0,1.0
13188957,12.0,10115966.0,37,13.0,18485.113446,3.0,10.0,0.0,0.0,0.27,...,1.0,4.0,15.0,1.0,1.0,30.0,133000.939458,0.0,5.0,1.0

# 處理缺失值

In [3]:
%%time
# Function to calculate missing values by column# Funct 
def missing_values_table(df):
        # Total missing values
        mis_val = df.isnull().sum()
        
        # Percentage of missing values
        mis_val_percent = 100 * df.isnull().sum() / len(df)
        
        # Make a table with the results
        mis_val_table = pd.concat([mis_val, mis_val_percent], axis=1)
        
        # Rename the columns
        mis_val_table_ren_columns = mis_val_table.rename(
        columns = {0 : 'Missing Values', 1 : '% of Total Values'})
        
        # Sort the table by percentage of missing descending
        mis_val_table_ren_columns = mis_val_table_ren_columns[
            mis_val_table_ren_columns.iloc[:,1] != 0].sort_values(
        '% of Total Values', ascending=False).round(1)
        
        # Print some summary information
        print ("Your selected dataframe has " + str(df.shape[1]) + " columns.\n"      
            "There are " + str(mis_val_table_ren_columns.shape[0]) +
              " columns that have missing values.")
        
        # Return the dataframe with missing information
        return mis_val_table_ren_columns
miss_table = missing_values_table(df)
miss_table

Your selected dataframe has 53 columns.
There are 9 columns that have missing values.
Wall time: 5.97 s

             Missing Values  % of Total Values
slam                1023527                5.2
gender_code          242749                1.2
age                  242749                1.2
trdtp                   365                0.0
educd                    14                0.0
masts                    10                0.0
naty                     10                0.0
poscd                    10                0.0
cuorg                    10                0.0

In [4]:
mean_fill_col = ['slam'] # 數值型用中位數補值(避免離群值拉高平均值)
cat_fill_col = ['gender_code','age','trdtp','educd','masts','naty','poscd','cuorg'] # 類別型用一個-999補值
for i in tqdm(mean_fill_col):
    df[i] = df[i].fillna(df[i].median())
for i in tqdm(cat_fill_col):
    df[i] = df[i].fillna(-999)
miss_table = missing_values_table(df)
miss_table

100%|██████████| 1/1 [00:00<00:00,  2.84it/s]
100%|██████████| 8/8 [00:01<00:00,  6.71it/s]

Your selected dataframe has 53 columns.
There are 0 columns that have missing values.

Empty DataFrame
Columns: [Missing Values, % of Total Values]
Index: []

In [5]:
df.isnull().sum().sum()

0

# sample 一個一個chid

In [6]:
chid = df.head(1)['chid'].values[0]
chid

10115966.0

# groupby('shop_tag')觀察txn_amt的sum並做排序

In [7]:
df.loc[df.chid==chid,['shop_tag','txn_amt']].groupby('shop_tag').agg('sum').sort_values(by='txn_amt',ascending=False)

                txn_amt
shop_tag
2         232533.602882
37        220452.379787
18        199466.732709
25        149987.199235
15         85987.255801
9          80153.137127
26         73621.598094
21         48616.442024
19         43486.774335
other      42050.804005
12         14781.543677
22         12620.221519
23         10954.250532
6           7265.943954
14          7176.877659
7           4610.710100

# groupby('shop_tag')觀察txn_amt的mean並做排序

In [8]:
df.loc[df.chid==chid,['shop_tag','txn_amt']].groupby('shop_tag').agg('mean').sort_values(by='txn_amt',ascending=False)

               txn_amt
shop_tag
2         21139.418444
37        16957.875368
18        16622.227726
25        14998.719924
12        14781.543677
19        14495.591445
26        12270.266349
21        12154.110506
23        10954.250532
15        10748.406975
other      8410.160801
6          7265.943954
14         7176.877659
22         6310.110759
9          6165.625933
7          4610.710100

# groupby('shop_tag')觀察txn_amt的median並做排序

In [17]:
df.loc[df.chid==chid,['shop_tag','txn_amt']].groupby('shop_tag').agg('median').sort_values(by='txn_amt',ascending=False)

               txn_amt
shop_tag
2         20273.605361
25        17534.700309
37        17415.509843
18        16050.848557
12        14781.543677
19        11727.199282
21        11693.120870
23        10954.250532
15        10184.547050
26         9432.714682
other      8411.143529
6          7265.943954
14         7176.877659
22         6310.110759
9          5767.360351
7          4610.710100

# 該chid之shop_tag的value_counts()

In [18]:
df.loc[df['chid']==chid,'shop_tag'].value_counts().to_frame()

       shop_tag
37           13
9            13
18           12
2            11
25           10
15            8
26            6
other         5
21            4
19            3
22            2
14            1
23            1
6             1
7             1
12            1

In [19]:
官方指認欄位 = ['2','6','10','12','13','15','18','19','21','22','25','26','36','37','39','48']
def chid2answer(chid,method=None):
    if method in ['sum','mean','median']:
        a = df.loc[df.chid==chid,['shop_tag','txn_amt']].groupby('shop_tag').agg(method).sort_values(by='txn_amt',ascending=False)
    elif method in 'value_counts':
        a = df.loc[df.chid==chid,'shop_tag'].value_counts().to_frame()
    else:
        raise 'error'
    a['在指認欄位'] = False
    a.loc[list(set(a.index)&set(官方指認欄位)),'在指認欄位'] = True #有交集的部份做個記號
    answer = a[a['在指認欄位']==True].head(3)
    display(answer)
    return answer.index.tolist()

In [21]:
d = {}
for method in tqdm(['sum','mean','median','value_counts']):
    print(method)
    answer = chid2answer(chid,method=method)
    d[method] = answer
d

  0%|          | 0/4 [00:00<?, ?it/s]

sum

                txn_amt  在指認欄位
shop_tag
2         232533.602882   True
37        220452.379787   True
18        199466.732709   True

mean

               txn_amt  在指認欄位
shop_tag
2         21139.418444   True
37        16957.875368   True
18        16622.227726   True

median

               txn_amt  在指認欄位
shop_tag
2         20273.605361   True
25        17534.700309   True
37        17415.509843   True

value_counts

    shop_tag  在指認欄位
37        13   True
18        12   True
2         11   True

100%|██████████| 4/4 [00:00<00:00, 38.56it/s]

{'sum': ['2', '37', '18'],
 'mean': ['2', '37', '18'],
 'median': ['2', '25', '37'],
 'value_counts': ['37', '18', '2']}